using System;

namespace Task02.StringSplit
{
    class Program
    {
        static void Main(string[] args)
        {
           
        }
        //static string MinWord(string text)
        //{
        //    text.Split()
        //}
    }
}
//Задание 2.Создание методов, которые принимают текст и возвращают слова


//Что нужно сделать
//Создайте два метода:

//Первый метод принимает строку с текстом и возвращает строку, содержащую слово с минимальной длиной.
//Второй метод также принимает на вход текст, но возвращает одно или несколько слов с максимальной длиной.


//Советы и рекомендации
//У класса строки есть метод Split, который поможет разбить текст на слова.
//У метода Split есть параметр options типа StringSplitOptions, который позволит избавится от пустых строк при разбиении. Подробнее о StringSplitOptions.


//Что оценивается
//Оба метода принимают строку как параметр.
//Один из методов возвращает строку, которая содержит слово с минимальной длиной.
//Один из методов возвращает массив или коллекцию строк. Каждая строка имеет такую же длину, как и самое длинное слово в тексте.
